/* eslint-disable prettier/prettier */
import React from 'react';
import './index.css';

export default class SubjectBachelors extends React.Component {
  constructor(props) {
    super(props);
    this.state = {};
  }

  render() {
    return (
      <div>
        {/* <dl>
  <dt>Fruits I like:</dt>
  <dd>Apples</dd>
  <dd>Bananas</dd>
  <dd>Oranges</dd>
</dl> */}
        <dl id="subject_list">
          <dt>В</dt>
          <dd><a href="">Вища математика</a></dd>
          <dd><a href="">Вступ до спеціальності</a></dd>

          <dt>Д</dt>
          <dd><a href="">Дипломне проектування</a></dd>
          <dd><a href="">Дослідження операцій</a></dd>

          <dt>Е</dt>
          <dd><a href="">Екологічні навчальні дисципліни</a></dd>
          <dd><a href="">Економіка і організація виробництва</a></dd>
          <dd><a href="">Економіка організації та планування виробництва</a></dd>
          <dd><a href="">Електродинаміка та поширення радіохвиль</a></dd>

          <dt>З</dt>
          <dd><a href="">Загальна фізика</a></dd>
          <dd><a href="">Захист інформації в телекомунікаційних системах</a></dd>

          <dt>I</dt>
          <dd><a href="">Інженерна та комп'ютерна графіка</a></dd>
          <dd><a href="">Іноземна мова</a></dd>
          <dd><a href="">Інтернет системи</a></dd>
          <dd><a href="">Інформатика</a></dd>
          <dd><a href="">Інформаційне забезпечення мобільних мереж телекомунікацій</a></dd>
          <dd><a href="">Інформаційне забезпечення телекомунікаційних мереж</a></dd>
          <dd><a href="">Історія науки і техніки</a></dd>
          <dd><a href="">Історія України</a></dd>
          <dd><a href="">Історія української культури</a></dd>

          <dt>M</dt>
          <dd><a href="">Мережні технології</a></dd>
          <dd><a href="">Моделювання глобальних мереж</a></dd>
          <dd><a href="">Моделювання та керування телекомунікаційними мережами - 2. Моделювання глобальних мереж</a></dd>

          <dt>Н</dt>
          <dd><a href="">Нормативні засади телекомунікацій</a></dd>

          <dt>O</dt>
          <dd><a href="">Основи конституційного права</a></dd>
          <dd><a href="">Основи метрології</a></dd>
          <dd><a href="">Основи теорії кіл</a></dd>
          <dd><a href="">Основи теорії телекомунікацій</a></dd>
          <dd><a href="">Охорона праці та цивільний захист</a></dd>
          

          <dt>П</dt>
          <dd><a href="">Передавальні та приймальні пристрої систем радіозв'язку</a></dd>
          <dd><a href="">Преддипломна практика</a></dd>
          <dd><a href="">Політологія</a></dd>
          <dd><a href="">Прикладне програмування в телекомунікаційних системах</a></dd>
          <dd><a href="">Програмні засоби в телекомунікаційних системах</a></dd>

          <dt>C</dt>
          <dd><a href="">Спеціальні розділи математики</a></dd>
          <dd><a href="">Схемотехніка</a></dd>

          <dt>Т</dt>
          <dd><a href="">Телекомунікаційні безпроводові системи</a></dd>
          <dd><a href="">Телекомунікаційні мережі</a></dd>
          <dd><a href="">Теорія массового обслуговування</a></dd>

          <dt>У</dt>
          <dd><a href="">Українська мова за професійним спрямуванням</a></dd>

          <dt>Ф</dt>
          <dd><a href="">Філософія</a></dd>

        </dl>
      </div>
    );
  }
}
