// it will JSON file in future

import Globa from './portrets/globa.png';
import Mogilevych from './portrets/mogilevych.png';
import Alexeev from './portrets/alexeev.png';
import Shelkovnikov from './portrets/shelkovnikov.png';
import Ilnickiy from './portrets/ilnickiy.png';
import Pravilo from './portrets/pravilo.png';
import Novogrudska from './portrets/novogrudska.png';
import Skulish from './portrets/skulish.png';
import Kurdecha from './portrets/kurdecha.png';
import Shtogrina from './portrets/shtogrina.png';
import Kononova from './portrets/kononova.png';
import Sulima from './portrets/sulima.png';
import Gaeviy from './portrets/gaeviy.png';

export const Teachers = [
  {
    id: 1,
    img: Globa,
    fullName: 'ГЛОБА ЛАРИСА СЕРГІЇВНА',
    description:
      'Професор, д.т.н., завідувач кафедри Інформаційно-телекомунікаційних мереж',
    education: 'вища, Харківський Авіаційний інститут',
    scienceDegree: 'доктор технічних наук (1996), професор (2001)',
    disciplines:
      'Розробка інформаційних ресурсів та систем, Інформаційне забезпечення телекомунікаційних мереж-2, Програмне забезпечення створення баз даних, Інтернет системи-2, Системи розподіленої обробки інформації в телекомунікаційних мережах',
    sphere:
      'Інтелектуальні системи підтримки прийняття рішень, Розподілені системи та технології, Інструментарій створення розподілених інформаційних систем, Паралельний комп’ютинг, Технології інформаційної взаємодії в безпроводовому телекомунікаційному середовищі, Технології Web-services',
    achievements: 'автор більш ніж 380 пуб­лікацій',
    contacts: 'lgloba@its.kpi.ua',
  },
  {
    id: 2,
    img: Mogilevych,
    fullName: 'МОГИЛЕВИЧ ДМИТРО ІСАКОВИЧ',
    description: ' Професор, д.т.н.',
    education: "вища, Київське вище військове училище зв'язку ім. Калініна",
    scienceDegree: 'Доктор технічних наук, професор',
    disciplines:
      "Імітаційне моделювання в телекомунікаціях та радіотехниці-1,2, Безпроводові інформаційно-комунікаційні системи-1. Системи радіорелейного та супутникового зв'язку",
    sphere: '',
    achievements: '',
    contacts: '',
  },
  {
    id: 3,
    img: Alexeev,
    fullName: 'АЛЄКСЄЄВ МИКОЛА ОЛЕКСАНДРОВИЧ',
    description: 'Доцент кафедри, с.н.с. ',
    education:
      'вища, Сумський Державний університет по спеціальності «Верстати та системи». У 2008 році отримав другу технічну вищу освіту за спеціальністю "Інфораційні мережі зв\'язку".',
    scienceDegree: 'кандидат технічних наук (2004)',
    disciplines:
      'Викладає дисципліни: Моделювання та керування телекомунікаційними мережами-1, Основи мережних операційних систем ',
    sphere:
      'Високопродуктівні розподілені обчислення, Автоматизовані системи керування розподіленими інформаційними системами',
    achievements:
      'Сфера наукової діяльності: Високопродуктівні розподілені обчислення, Автоматизовані системи керування розподіленими інформаційними системами',
    contacts: ' http://intellect.its.kpi.ua/profile/amo8',
  },
  {
    id: 4,
    img: Shelkovnikov,
    fullName: 'ШЕЛКОВНІКОВ БОРИС МИКОЛАЙОВИЧ',
    description: 'Доцент кафедри, к.т.н.',
    education: "вища, Новосибірський електротехнічний інститут зв'язку",
    scienceDegree:
      'Теорія електричних кіл-1, Основи теорії лінійних кіл та сигналів, Теорія електричних кіл-2, Основи теорії нелінійних кіл',
    disciplines:
      'Сфера наукової діяльності: Тіорія нелінійних кіл та систем, Автоматизація проектування НВЧ телекомунікаційних пристроїв і систем, Використання нових технологій при розробці НВЧ телекомунікаційних пристроїв та систем',
    sphere: '',
    achievements: '',
    contacts: ' http://intellect.its.kpi.ua/profile/hbm0',
  },
  {
    id: 5,
    img: Ilnickiy,
    fullName: 'ІЛЬНИЦЬКИЙ АНАТОЛІЙ ІВАНОВИЧ',
    description: 'Доцент кафедри, к.т.н.',
    education: 'вища, Київське вище інженерне радіотехнічне училище ППО',
    scienceDegree: '',
    disciplines:
      'Викладає дисципліни: Основи теорії кіл, Операторська платформа надання послуг',
    sphere:
      'Тіорія нелінійних кіл та систем, Автоматизація проектування НВЧ телекомунікаційних пристроїв і систем, Використання нових технологій при розробці НВЧ телекомунікаційних пристроїв та систем',
    achievements: 'Має більше 85 публікацій',
    contacts: ' http://intellect.its.kpi.ua/profil/iai7',
  },
  {
    id: 6,
    img: Pravilo,
    fullName: 'ПРАВИЛО ВАЛЕРІЙ ВОЛОДИМИРОВИЧ',
    description: 'Доцент кафедри, к.т.н.',
    education: "вища, Київський військовий інститут управління та зв'язку",
    scienceDegree:
      'Науковий ступінь та вчене звання: кандидат технічних наук (2007)',
    disciplines:
      'Телекомунікаційні мережі-1, Основи теорії телекомунікаційних мереж, Управління телекомунікаційними мережами, Теорія мереж та управління - 1, 2, Інформаційне забезпечення синхронізації часу в телекомунікаційних мережах',
    sphere: '',
    achievements: '',
    contacts: ' http://intellect.its.kpi.ua/profil/pvv110',
  },
  {
    id: 7,
    img: Novogrudska,
    fullName: 'НОВОГРУДСЬКА РІНА ЛЕОНІДІВНА',
    description: 'Доцент кафедри, к.т.н.',
    education: 'вища, НТУУ "КПІ"',
    scienceDegree: 'кандидат технічних наук (2016)',
    disciplines:
      'Теорія прийняття рішень та системний аналіз-1,2, Системне проектування ТКМ',
    sphere: '',
    achievements: ' http://intellect.its.kpi.ua/profil/nrl',
    contacts: '',
  },
  {
    id: 8,
    img: Skulish,
    fullName: 'СКУЛИШ МАРІЯ АНАТОЛІЇВНА',
    description: 'Доцент кафедри, д.т.н., с.н.с.',
    education: 'Освіта: вища, НТУУ "КПІ"',
    scienceDegree: 'доктор технічних наук (2019)',
    disciplines:
      "Інформатика - 1,2, Технології програмування, Прикладне програмування в телекомунікаційних системах - 1, Апаратне та програмне забезпечення комп'ютерної техніки, Спеціальні розділи математики, Дослідження операцій, Захист інформації в ТКМ, Математичні методи аналізу та проектування телекомунікаційних систем та мереж-1,2",
    sphere: '',
    sphere:
      'Захист інформаційних ресурсів, Безпека в телекомунікаційних системах, Дослідження операцій (теорія та методи оптимізації), Застосування відомих матиматичних методів в телекомунікаціях, Системи тарифікації в телекомунікаційних компаніях',
    achievements:
      'Захист інформаційних ресурсів, Безпека в телекомунікаційних системах, Дослідження операцій (теорія та методи оптимізації), Застосування відомих матиматичних методів в телекомунікаціях, Системи тарифікації в телекомунікаційних компаніях',
    contacts: ' http://intellect.its.kpi.ua/profil/sma29',
  },
  {
    id: 9,
    img: Kurdecha,
    fullName: 'КУРДЕЧА ВАСИЛЬ ВАСИЛЬОВИЧ',
    description: 'Асистент',
    education: 'вища, НТУУ "КПІ"',
    scienceDegree: '',
    disciplines:
      'Основи дискретної схемотехніки, Імітаційне моделювання - 1, Інформаційне забезпечення телекомунікаційних систем-1, Інформаційні технології для мобільних мереж, Основи мікросхемотехніки, Імітаційне моделювання систем та процесів, Завадостійке кодування в телекомунікаційних технологіях, Системи абонентського доступу',
    sphere:
      'Захист інформаційних ресурсів, Безпека в телекомунікаційних системах, Дослідження операцій (теорія та методи оптимізації), Застосування відомих матиматичних методів в телекомунікаціях, Системи тарифікації в телекомунікаційних компаніях',
    achievements: '',
    contacts: ' http://intellect.its.kpi.ua/profil/kvv168',
  },
  {
    id: 10,
    img: Shtogrina,
    fullName: 'ШТОГРІНА ОЛЕНА СЕРГІЇВНА',
    description: 'Доцент кафедри, к.т.н.',
    education: 'вища, НТУУ "КПІ"',
    scienceDegree: '',
    disciplines:
      'Основи мережних операційних систем, Прикладне програмування в інфокомунікаційних системах-2, Мережні технології-2, Технології Інтернет',
    sphere:
      'Територіально-розподілені інформаційні та інформаційно-аналітичні системи, Портальні рішення для інформаційного забезпечення діяльності установ, відомств, інформування широких кіл громадськості',
    achievements: '',
    contacts: ' http://intellect.its.kpi.ua/profil/hos95',
  },
  {
    id: 11,
    img: Kononova,
    fullName: 'КОНОНОВА ІРИНА ВІТАЛІЇВНА',
    description: 'Доцент, к.т.н.',
    education: 'вища, НТУУ "КПІ"',
    scienceDegree: '',
    disciplines:
      "Безпроводові інформаційно-комунікаційні системи-1. Системи радіорелейного та супутникового зв'язку",
    sphere: '',
    achievements: '',
    contacts: '',
  },
  {
    id: 12,
    img: Sulima,
    fullName: 'СУЛІМА СВІТЛАНА ВАЛЕРІЇВНА',
    description: 'Асистент',
    education: 'вища, НТУУ "КПІ"',
    scienceDegree: '',
    disciplines:
      'Інформатика-2, Технології програмування,Прикладне програмування - 1, 2, Програмне забезпечення створення баз даних',
    sphere: '',
    achievements: '',
    contacts: '',
  },
  {
    id: 13,
    img: Gaeviy,
    fullName: 'ГАЄВИЙ ВАДИМ ВОЛОДИМИРОВИЧ',
    description: 'Асистент, аспірант',
    education: 'вища, НТУУ "КПІ"',
    scienceDegree: '',
    disciplines: 'Інтернет систем-2',
    sphere: '',
    achievements: '',
    contacts: '',
  },
  {
    id: 14,
    img: '',
    fullName: 'БУГАЄНКО ЮРІЙ МИХАЙЛОВИЧ',
    description: 'Асистент, аспірант',
    education: 'вища, НТУУ "КПІ"',
    scienceDegree: '',
    disciplines: '',
    sphere: '',
    achievements: '',
    contacts: '',
  },
];
