import React from 'react';
import './Text.css';
import image from './images/image.png';
import image2 from './images/image 2.png';
import image3 from './images/image 5.png';
import image4 from './images/image 6.png';
import image5 from './images/image 7.png';
import image6 from './images/image 8.png';
import image7 from './images/image 9.png';

import Img from '../../components/Img/index';
export default function Text(){
    return(
        <div className = 'text'>
            <h1>
                Про Кафедру
            </h1>
            <h2>
                Історія кафедри ІТМ
            </h2>
            <p>
            <Img src = {image} className = 'image1'/>
            В НТУУ “КПІ” напрям підготовки “Телекомунікації” був затверджений після створення в 2002р.
            кафедри Телекомунікаційних систем та мереж (ТСМ), яку очолила професор, д.т.н. Глоба Л.С., яка на той
            час вже була відомим науково-педагогічним фахівцем в галузі інформаційно-телекомунікаційних технологій.
            На потребу необхідності навчання студентів в напрямку "Телекомунікації" інформаційним технологіям в 2004 році
            на базі кафедри ТСМ була створена кафедра Інформаційно-телекомунікаційних мереж (ІТМ) в Інституті телекомунікаційних систем НТУУ "КПІ".
             Результати роботи кафедри зі спеціальності “Інформаційні мережі зв’язку” дали підставу для отримання ліцензії та сертифікату про акредитацію 
            (Серія НД-ІV №112361 від 30.06.2005р.) Міністерства освіти та науки України на право навчання та видачу дипломів студентам-випускникам з цієї спеціальності, 
            що засвідчило про високий рівень організації навчання студентів та їх рівень знань. За ці роки вона підготувала сотні молодих інженерів широкого профілю, які на 
            сьогодні працюють в провідних компаніях та організаціях інформаційно-телекомунікаційного профілю інженерами електрозв'язку, інженерами з експлуатації обладнання електрозв'язку, 
            інженерами з керування й обслуговування систем, інженерами-дослідниками, інженерами з організації виробничих процесів електрозв'язку, системними адміністраторами мереж електрозв'язку і тощо. 
            </p>
            <Img src = {image2} className = 'image1'/>
            <Img src = {image3} className = 'image1'/>
            <p className = 'textunderphoto'>
                Студенти кафедри в 2007-2008 навчальному
                році вибороли звання найкращої групи ІТС
            </p>
            <h2>
            Студенти кафедри ставали студентами року ІТС:
            </h2>
            <Img src={image4}  className = 'image2'/>
            <Img src={image5}  className = 'image2'/>
            <Img src={image6}  className = 'image2'/>
            <Img src={image7}  className = 'image2'/>
        </div>
    );
}