import React from 'react';
import './Text.css';
import BlockList from '../../components/BlockList/index';
import LearningForm from '../../components/LearningForm/index';
import Information from '../../components/InformationBox/index';
import InformationSlider from '../../components/InformationBoxSlider/index';
import ForEnterer from '../../components/ForEntrant/index';

import Slider from '../../components/Slider';
import News from '../../components/News/index';
import '../../components/News/index.css';


export default function Text(){
    return(
        <div className = 'text'>
            <div>
                <h3>Спеціальність:</h3>
                <h2>172 Телекомунікації та радіотехніка</h2>
            </div>
            <div>
                <h3>Кафедра</h3>
                <h1>Інформаційно-телекомунікаційних мереж</h1>
            </div>
            <div className = "Qualification">
                <div>
                    <h1>Опис професії</h1>
                    <h2>Кваліфікаційні рівні</h2>
                </div>
                <div className = "Block">
                    <BlockList center_level="I" numberName="Перший" boldName="Бакалаврський" />
                    <BlockList center_level="II" numberName="Другий" boldName="Магістрський" />
                    <BlockList center_level="III" numberName="Третій" boldName="Освітньо-науковий" />
                </div>
            </div>
            <div className = "Learning_Form">
                <h2>Форми навчання</h2>
                <div className = "Block">
                        <LearningForm  numberName="Форма навчання" boldName="Денна" />
                        <LearningForm  numberName="Форма навчання" boldName="Заочна" />
                </div>
            </div>
            <div className = "Text_Information">
                <div className = "Block"> 
                    <Information header="
                        Унікальні специфічні знання, вміння та навички якими володіють випускники
                        " content="
                        Кафедра інформаційно-телекомунікаційних мереж здійснює підготовку фахівців у напрямку забезпечення користувачів послугами телекомунікаційних мереж та програмним забезпеченням їх функціонування. Випускники володіють знаннями, вміннями та навичками, ща дозволяє їм аналізувати та впроваджквати телекоунікаційні технології, розробляти програмне забезпечення прийому-передавання інформації та абонентського доступу до ресурсів телекомунікаційних мереж, виконувати моніторинг, проводити моделювання, системний аналіз, дослідження операцій, забезпечувати захист інформації в інформаційно-телекомунікаційному середовищі.
                        "/> 
                    <Information header="
                        Теми дипломних робіт (основні напрямки магістерських досліджень)
                        " content="
                        Магістерські роботи направлені на дослідження в сфері удосконалення технологій надання послуг користувачам телекомунікаційних мерж шляхом аналізу, розрахунку та комп’ютерного моделювання. До напрямків робіт належать: алгоритмічне та програмне забезпечення захисту інформації в мобільних мережах; дослідження можливості підвищення якості послуг в супутникових мережах зв’язку; автоматизація технологій тестування працездатності базових станцій систем стільникового зв’язку; гетерогенні телекомунікаційні мережі наджання мультимедійних послуг.
                        "/> 
                    <Information header="
                        Ким можуть працювати випускники відповідно до державного класифікатора професій
                        " content="
                        Випускники ІТС можуть працювати в якості керівників середнього та нижчого рівнів управління, спеціалістів виробничих підрозділів підприємств, консультантів з інформаційного забезпечення. Бакалаври можуть працювати на інженерних посадах телекомунікаційних компаній та організацій з експлуатації та обслуговування апаратури. Магістри можуть працювати на організаційних науково-дослідних та керівних посадах в галузі телекомунікацій і виконувати наукові дослідження та розробки інформаційно-телекомунікаційних технологій, приймати тактичні та стратегічні рішення з технологічних задач роботи обладнання систем та мереж зв’язку.
                        "/> 
                    <Information header="
                        Де працюють випускники
                        " content="
                        Випускники ІТС працюють в установах державної та недержавної форм власності: ВАТ “Укртелеком”, „Датагруп”, МТС, „Київстар”, ЗАТ “УкрСат”, „Голден Телеком”, “Воля Кабель”, “Моторола”, „HUAWEY TECHNOLOGIES”, банківських установах – “Банкомзв’язок”, в компаніях з інформаційними послугами ТОВ “Комп’ютер та сервіс”, ТОВ “Телеком – дистрибюшен”, СП ТОВ “Інтернешнл Телеком’юнікешен Компані”, НДЦ „Квазар” та в багатьох інших.
                        "/> 
                    <Information header="
                        Додаткова освіта: підвищення кваліфікації, друга вища, тренінги, тощо
                        " content="
                        ІТС готує фахівців за другою вищою освітою за спеціальністю: Інформаційно-комунікаційні технології​
                        "/> 
                    <Information header="
                        Місця проходження практики
                        " content="
                        ВАТ Укртелеком, ТОВ “Голден Телеком”, ЗАТ ”ДАТАГРУП”, ЗАТ “Київстар Дж.Ес.Ем.”, ЗАТ “Український Мобільний Зв’язок”, ТОВ “Глобал Телеком”, ВАТ “Бамкомзв’язок”, АТ Банк “ТАВРИКА”, Huawei Technologies Co., LTD., “ІНВЕКС Телеком” т.і. 
                        "/> 
                </div>
            </div>
            <div className = "Information_for_Students">
                <h1>Інформація для студентів</h1>
                <div className = "Block">
                    <ForEnterer icon_image="I" boldName="Вступ на 1-й курс" numberName="за сертифікатами ЗНО" />
                    <ForEnterer icon_image="I" boldName="Вступ на 1-й курс" numberName="за дипломом молодшого спеціаліста" />
                    <ForEnterer icon_image="I" boldName="Вступ на 5-й курс" numberName="" />
                    <ForEnterer icon_image="I" boldName="Офіційні документи" numberName="" />
                {/* entrant */}
            </div>
            </div>
                <div className = "contacts_inf">
                    {/* Чи можна використовувати ForwardMessage длclassName = "Drezden_article" номера телефону та пошти*/}
                    <h2>Контакти вибіркової комісії ІТС</h2>
                    <div className = "telephone">Телефон відбірковї комісії ІТС:<p className="telephoneNumber">(068)-357-08-44</p></div>
                    <div className = "mail">Електронна пошта відбіркової комісії ІТС:<p className = "e_mail">novikov1967@ukr.net</p></div>
                </div>
                <a href="#">Поширені запитання (FAQ)</a>
                <div className="container_Slider">
                    <Slider/>
                    <InformationSlider 
                        mainHeader ="Подвійний диплом" 
                        header="Єдина магістерська програма" 
                        content = "У рамках Європейської програми магістратури Distributed Systems Engineering, Інститут телекомунікаційних систем Національного технічного університету України «Київський політехнічний інститут» (НТУУ «КПІ») та факультет Інформатики Технічного університету м. Дрездена (ТУД) пропонують єдину міжнародну програму «Інженерія розподілених систем»."
                    />
                </div>
                    <h1>Новини</h1>
                    <div className = "container_News">
                        <News 
                        mainHeader = "Захар Савчук рассказал как правильно настраивать спутниковую антену"
                        date = "06.01.19"
                        content = "Студенти НТУУ «КПІ» мають можливість навчатися по програмам магістратури НТУУ «КПІ» «Інформаційні мережі зв’язку» у поєднанні з програмою магістратури ТУД «Інженерія розподілених систем» (Distributed Systems Engineering) для отримання другої вищої освіти. Формування та підготовка груп студентів починається з другого року їх навчання в НТУУ «КПІ» за результатами завершення першого року навчання..."
                        readMore = "Читати далі"
                        />
                        <News 
                        mainHeader = "Группа студентов- волонтеров поехала проводить элетричество"
                        date = "06.01.19"
                        content = "Студенти НТУУ «КПІ» мають можливість навчатися по програмам магістратури НТУУ «КПІ» «Інформаційні мережі зв’язку» у поєднанні з програмою магістратури ТУД «Інженерія розподілених систем» (Distributed Systems Engineering) для отримання другої вищої освіти. Формування та підготовка груп студентів починається з другого року їх навчання в НТУУ «КПІ» за результатами завершення першого року навчання..."
                        readMore = "Читати далі"
                        />
                        <News 
                        mainHeader = "Илон Маск согласился кооперировать с факультетами ИТС"
                        date = "06.01.19"
                        content = "Студенти НТУУ «КПІ» мають можливість навчатися по програмам магістратури НТУУ «КПІ» «Інформаційні мережі зв’язку» у поєднанні з програмою магістратури ТУД «Інженерія розподілених систем» (Distributed Systems Engineering) для отримання другої вищої освіти. Формування та підготовка груп студентів починається з другого року їх навчання в НТУУ «КПІ» за результатами завершення першого року навчання..."
                        readMore = "Читати далі"
                        />
                    </div>
                </div>
    );
}